[
    {
        "id": "j2e7ff",
        "title": "Watching Trump speak over his allotted time and interrupt not only Joe Biden but also Chris Wallace constantly was infuriating.",
        "content": "I was a state champion debater in high school and debated in college. The lack of manners and etiquette Trump showed tonight is abhorrent. Regardless of your political ideology, you should support a structured debate where the moderator CUTS THE MIC OFF of whoever is not called upon to speak. Frankly the American people deserve better.",
        "upvotes": 130,
        "author": "MercAnon",
        "flair": null,
        "subreddit": "uspolitics",
        "date": 1601435356
    },
    {
        "id": "j6kiqj",
        "title": "So basically, Trump is holding a second stimulus over our heads as leverage?",
        "content": "[https://www.cnbc.com/2020/10/06/trump-says-hes-calling-off-stimulus-negotiations-with-democrats-until-after-the-election.html](https://www.cnbc.com/2020/10/06/trump-says-hes-calling-off-stimulus-negotiations-with-democrats-until-after-the-election.html)\n\n> “I have instructed my representatives to stop negotiating until after  the election when, immediately after I win, we will pass  a major Stimulus Bill that focuses on hardworking Americans and Small  Business,” \n\nSo basically, if he loses the election, he'll withhold the stimulus out of spite?! If we want the second stimulus, we have to re-elect him, otherwise we get nada until January?!\n\nFuck you, Donald.",
        "upvotes": 94,
        "author": "acerthorn",
        "flair": null,
        "subreddit": "uspolitics",
        "date": 1602044969
    },
    {
        "id": "j7f4e2",
        "title": "The polls are not destiny. If you don't vote, Trump wins, end of story. VOTE.",
        "content": "In the midst of multiple news outlets touting Biden's hypothetical lead over Trump, it sometimes gets lost that this lead only becomes reality if people vote.\n\nDo not allow yourself to become complacent. If you (yes, *you*, you personally, the human being sitting at your computer and reading these words), do not vote, then Trump will win, regardless of what the polls say.\n\nSay what you will about Republicans, but they always get out to vote. Even when it looks like they'll lose, even when they haven't researched the issues or the candidates, they get out and vote, every time. And that's how they win.\n\nVoting is the only way we can take this country back. Get out there and do your duty, for yourself, for your loved ones, for your fellow Americans, and for the marginalized and vulnerable who are counting on you to help them. We cannot afford to mess this one up.",
        "upvotes": 1024,
        "author": "Judgment_Reversed",
        "flair": null,
        "subreddit": "Liberal",
        "date": 1602170967
    },
    {
        "id": "ivni08",
        "title": "With the death of Ruth Bader Ginsburg, I just wanted to remind the liberal purists who refused to vote for Hillary Clinton what total scumbags you are",
        "content": "...and how much worse you are than anyone that directly voted for Donald Trump in 2016 and how much more hatred you deserve from the people screwed over by the Trump administration.\n\nI know. You just didn’t like Hillary. She was the lesser of two evils. She would have been just as bad as Trump. I can’t believe these are our only two options. This is why the two party system sucks, etc., a million other stupid reasons she wasn’t good enough.\n\nBe sure to keep repeating those total bullshit lies to yourselves over the next few decades, every time the old white guy who replaces Ginsburg, rules oppositely of how she would have and sets social progress back decades.\n\nJust remember to look on the bright side; at least you didn’t have to suffer through a Hillary Clinton presidency.\n\nYes, it was your right to refuse to vote for her, either by voting 3rd party or not voting at all, but like all other freedoms, the right to vote does not mean freedom from social consequences. It’s the right of people who voted for Hillary Clinton to forever blame and hate you for Trump getting elected and for every bad thing his presidency has caused.",
        "upvotes": 827,
        "author": "bong-dynasty-emperor",
        "flair": "brigaded",
        "subreddit": "Liberal",
        "date": 1600497689
    },
    {
        "id": "ik1k3m",
        "title": "Please consider voting in person if you aren’t high risk! 10% of mail ballots were not even counted during an election earlier this Fall!",
        "content": "I’m shocked this isn’t a bigger deal. Hundreds of thousands of Biden ballots might go uncounted due to mismatching signatures, mail delays, and other issues. That could EASILY tip the election. Why risk your vote not being counted in the most important election ever in this country, unless you are at significant risk if you get COVID? Why be one of the potentially 1 in 10 Biden voters whose vote does not get counted? \n\nPeople wait in lines at the grocery store and Walgreens...why is it any riskier to wait in a line at the booth where people will presumably already be spaced 6 feet apart and where masks might be required anyway? This should be a huge news issue but most people aren’t even realizing there could be 230,000+ Biden ballots not counted [47% of Biden voters said they may vote by mail (there will probably be over 50 million Biden votes, so 23.5 million mail Biden votes), and 1/10th of those would be around or over 230k].\n\nOne way or another, do everything possible to make sure your vote is counted!",
        "upvotes": 540,
        "author": "--Gingersnap--",
        "flair": null,
        "subreddit": "Liberal",
        "date": 1598892390
    },
    {
        "id": "jmfefs",
        "title": "Is venting allowed here?",
        "content": "Disclaimer: Anti-Trump conversation. Swearing. \n\nLong time lurker. Never posted here. I need to vent before election night to like-minded people & make sure I'm not crazy. Not too sure this is allowed here, but here goes:\n\nI am actually devastated that this thing is a serious toss up. It is fucking insane that people are seriously voting for Trump at all. He is an endlessly corrupt reality TV, trust fund moron. No morals, endless scandals and completely off-putting behavior all around. He has exploited every gullible republican with identity politics as his weapon. No other president has ever deliberately divided us more. I am so embarrassed and full of rage/shame that half of the country literally fell for his lies, deflections and repetitive rhetoric. It is heart breaking. How did this happen? Are we that lacking in education? How do we have such a severe critical thinking problem? Why in the world are we so obsessed with this red team blue team bullshit?\n\nGetting election jitters and would love to hear from y'all. Thanks and don't forget to vote if you haven't already!\n\nEdit: a typo.",
        "upvotes": 534,
        "author": "cha1ex",
        "flair": null,
        "subreddit": "Liberal",
        "date": 1604284488
    },
    {
        "id": "jjpjil",
        "title": "As a Muslim, I endorse Donald J. Trump in the 2020 election",
        "content": "As a Muslim, I endorse Donald J. Trump for the 2020 election. I am constantly attacked by the \"accepting\" left for being a minority that supports Trump and I want people here to know that lots of Muslims stand with you. There is a common misconception put out by Democrats that Trump is a xenophobic Muslim hater. Simply not true. I agree with him that we need to fight the radicals. You might not care but I'm posting this to let you guys know we're with you. I will say I'm not a \"hardcore\" Muslim in that I don't pray 5 times a day and I don't follow every rule word for word (hijabs are pretty pointless imo, pretty ancient rule) but I'd like you guys to know that we do not associate with the radicals. They don't represent us. We too believe in God and Jesus as the Messiah. Muslims for Trump 2020! I was brainwashed into thinking Clinton was the right choice in 2016 but now I can't wait to drink liberal tears this November.",
        "upvotes": 806,
        "author": "redpillapprentice",
        "flair": "👀 WOKE 👀",
        "subreddit": "trump",
        "date": 1603897869
    },
    {
        "id": "jgucd5",
        "title": "Trump Converted me last night",
        "content": "Sure he’s a polarising figure but ya know something clicked in me last night that actually there’s a lot of method to his madness.\n\nThere’s a lot of truth to what he says “the cure shouldn’t be worse than the virus itself”\n\nI told my family and they were shook but in a way he’s actually doing gods work without a lot of democrats realising it. I’ve been democrat since 08’ but it took until now to realise that the Democratic Party is not the party of Obama and substantial change anymore and it’s not been that way for a long time.\n\nAs a computer scientist I think Andrew Yangs stance on big tech is the most pertinent issue to the election... and the fact is that Trump is the only person that can save us from the media and big tech now that they’ve bought out the entire left seemingly.\n\nI am disgusted. And I ceed, Trump 2020!\n\nMay the next 4 years be a great one Mr Trump I am your new biggest fan.",
        "upvotes": 729,
        "author": "lemonmamgo",
        "flair": null,
        "subreddit": "trump",
        "date": 1603482527
    },
    {
        "id": "jjsgwx",
        "title": "I’m officially voting for Trump and here is why.",
        "content": "After spending some time in r/Trump and r/JoeBiden. I’ve come to realize it’s mostly r/trump memeing on r/JoeBiden and r/JoeBiden feeling butt hurt. I just thought that was funny. However I will vote for trump because clearly trump isn’t racist. Biden is. Trump stands for the people. Biden presidency pushes towards more government power. And last trump hasn’t been giving a fair chance. Racial tensions started since day 1 Trump was elected. We had Obama in office for 8 years and wonder why there are still racial tensions. I don’t remember riots because we elected a black president. Everyone who was against Obama said well shit that sucks and went along with life. Republicans seem to have there head on straight. And I thank you for that. I’m now an open republican. Have a great day.",
        "upvotes": 682,
        "author": "ChronoSenju",
        "flair": ":T: FOUR MORE YEARS :T:",
        "subreddit": "trump",
        "date": 1603906950
    },
    {
        "id": "jc00a7",
        "title": "So let me get this straight ... President Trump was false impeached for what was revealed today to be Joe Biden's hidden corruption?",
        "content": "**Undecided voter here.**\n\n**Is what I'm understanding from the NY Post revelations correct?**\n\n**From what I know:**\n\n- February 2014, Hunter Biden discharged from the US Navy for drug violations.  \n\n- Somehow lands job @ Burisma months later that pays $50,000+ monthly for \"introductions\" / meetings with his father, Joe Biden ...  \n\n- ... who is conveniently the main contact for the Obama administration on Ukraine.  \n\n- Prosecutor Yarema seeks to investigate Hunter Biden & Burisma for corruption.  \n\n- Joe Biden threatens to hold $1+ billion aid to Ukraine if Yarema is not let go.  \n\n- Yarema is let go.  \n\n- Joe Biden then claims to have never interacted with Burisma ... but the emails show this is a lie?  \n\n- Then the Biden campaign chooses not to denounce the emails whatsoever? WTF?\n\nSo how is this not grift? It's literally cash-for-influence, but apparently President Trump is the one that is \"compromised?\" Am I living in loony land, how is this not massive news? Where is the politics subreddit on this this at all?\n\nALSO - I'm trying to find more information ... but Facebook, YouTube, Twitter, Wikipedia and just about every single big media source are blocking the story for my \"safety.\" I had to visit Tim Pool's YT page and some Aussie Sky News site to see it. Huh? Is this not blatant censorship?\n\nLook, I'm no die-hard supporter of any side. But for someone who is trying to find information and make an informed choice, this looks SO SHADY.\n\n**Can someone from this subreddit PLEASE give me their viewpoint, because if I'm not too far off in what I understand then it's abundantly clear who I should vote for. Thanks.**",
        "upvotes": 550,
        "author": "Hobobobolobo",
        "flair": null,
        "subreddit": "trump",
        "date": 1602809375
    },
    {
        "id": "ioufix",
        "title": "After years of blindly hating on Trump I've changed my mind.",
        "content": "Since last election year until this year ive blindly been hating on Trump mainly following and believing the terrible things the media has had to say about Trump. This year I did my research and have been sticking to non-liberal/non-biased media and have changed my mind and will be voting for the first time for Trump. \n\nMAGA 2020!\n\nEdit: To the people calling me \"Fake\" and this post \"bullshit\" I couldn't care less for internet points. This has been bothering me for a while and I've finally come to terms with who I want as president and its really nice to get it off of my chest.\n\nThank you to everyone's support!",
        "upvotes": 497,
        "author": "Offishlgmr",
        "flair": ":T: TRUMP 2020 :T:",
        "subreddit": "trump",
        "date": 1599574919
    },
    {
        "id": "jjx1vg",
        "title": "I am a Democrat and Voted for Hillary in 2016. I am voting for Donald Trump in 2020 because Joe Biden picked Kamala Harris",
        "content": "She was a terrible choice like doesn’t he understand she was the most disliked candidate out of any of his potential picks. He picked her for only two reasons Gender and Race that’s it. She is more radical than Bernie Sanders and the vast majority of Democrats didn’t even vote for her because of her terribly run presidential campaigns, she had 3% in the polls didn’t get any of the black vote and dropped out before the primary of her own home state which she is a senator for. She is extremely radical but I have no clue why Joe Biden thought this would gain him popularity or why this was a good idea, she insulted him and she was always against him during her campaign and now this all magically goes away. She was a terrible choice for VP and I don’t know why even thought I like Joe Biden that it would be a good idea to vote for this terrible VP choice by him.",
        "upvotes": 374,
        "author": "Icelandairs",
        "flair": ":USA: USA :USA:",
        "subreddit": "trump",
        "date": 1603921296
    },
    {
        "id": "jgdnwx",
        "title": "Trump killing it right now",
        "content": "Last debate I posted about how terribly Trump was doing and how he needed to let Biden talk and focus on the issues. \n\nThis time Trump is doing it and so much more. This is the best and most Presidential I've ever seen him. He is sticking to the issues, addressing the points directly, and being articulate and authentic while throwing some incisive shade at Biden where it's called for. He's destroying Biden who's dodging every question with typical platitudes and transparent political bullshit, on which Trump called him out DIRECTLY. I just wish Trump was like this the last 4 years and sincerely hope he'll have another 4 to follow through.",
        "upvotes": 343,
        "author": "gusmeowmeow",
        "flair": ":T: FOUR MORE YEARS :T:",
        "subreddit": "trump",
        "date": 1603418055
    },
    {
        "id": "j2d9e1",
        "title": "Chris Wallace is shit",
        "content": "Interrupts Trump in the middle of his statements. Gives the floor to Biden. Doesn't shut up Biden during his interruptions. This is a complete shit show.",
        "upvotes": 318,
        "author": "owntastic",
        "flair": null,
        "subreddit": "trump",
        "date": 1601431710
    },
    {
        "id": "iwnt7h",
        "title": "Who else loves the fact Trump gets THREE SUPREME COURT PICKS IN ONE TERM?",
        "content": "As far as I am concerned this is revenge and some sweet sweet Karma. I am very happy Republicans are actually going through with this and not backing down like they normally would. Trump has taught them well that you don’t need to kiss the Democrat state run medias ass to win elections. \n\nAlso why isn’t any of the Republicans actually saying this fact outloud? We all know it’s because Democrats impeached Trump because they have been hunting the witch for 4 years and have come up empty each time. Why do Republicans keep trying to come up with some bull shit excuse? They don’t need to explain themselves to a partisan media. Just do it and say what were all thinking “its because Democrats Impeached Trump during a election season”. And Democrats have already said they will take this election to Court (even though Biden has no base of support). Just say those two things and watch there heads explode with but but but but.",
        "upvotes": 287,
        "author": "Stevemagegod",
        "flair": ":T: FOUR MORE YEARS :T:",
        "subreddit": "trump",
        "date": 1600641019
    },
    {
        "id": "iptp6h",
        "title": "I can't do this anymore, I'm voting for Biden",
        "content": "I was a huge Trump supporter in 2016, and honestly believed and said some really, really horrible things, I followed the Q stuff for awhile as well but after repeated predictions never happened I left that idea, and am really worried about a couple friends that are still in deep.\n\nI had decided I wasn't voting for Trump earlier this year after I saw his handling of COVID being unacceptably incompetent, but hearing his own words that he lied to me and to everyone else about COVID pushed me over the line. Also even though there's not proof, I know in my heart that what's he allegedly said about the troops is true.\n\nI don't really like Biden, or his policies, but Trump must be stopped. I'm voting for Biden, also I live in Pennsylvania, for what that's worth.\n\nYou can look through my post history if you want, I made this account to troll Hillary in 2016, and looking back at some of my comments I can't believe how vile and frankly stupid I was.",
        "upvotes": 3810,
        "author": "UncuckOrGetFucked",
        "flair": ":snoo_feelsgoodman: Discussion :snoo_thoughtful:",
        "subreddit": "JoeBiden",
        "date": 1599701320
    },
    {
        "id": "irn9k0",
        "title": "Flipped a voter from Trump to Biden during a WI phone-bank today!",
        "content": "It was the last call of the day. The phone bank was intended only for reaching out to Biden voters, to help them register and request their ballots. I asked this voter the usual questions and he said he was both registered and had requested his ballot.\n\nFinally, I asked him if he was supporting Joe Biden. He paused and said he was unsure. Going off script, I asked him if there was any questions I could answer about Joe.\n\nHe was a supporter of Bernie Sanders in the primary. I replied that I was as well. He asked me what positions Biden had taken that are the same as Bernie. I quickly pointed out that he supports $15/hr minimum wage like Bernie had pushed for since 2016. He also favors of lowering the age of Medicare to 60, which is a step in Bernie’s goal of setting the age to 0. Biden wants a public option, also a step towards single payer.\n\nI also noted that Biden has always been ideologically flexible. His voting record in the Senate was always in the exact middle of the party. A majority of Democratic primary voters supported single payer. Biden tries to move with the center of mass of the party. Biden is an excellent lower case democrat in that sense.\n\nFinally, he asked about Biden’s plans for students. I actually didn’t know either so I looked it up with him on the phone. We were both impressed to learn his plan is very progressive! He wants free public colleges and student loan forgiveness after 20 years.\n\nThe conversion ended with him telling me he was changing his vote from Trump to Biden!  I felt elated to have flipped a Trump voter. There are still open minded persuadable voters out there. Don’t be afraid to go off script and try convincing voters with the facts. Go Joe! No brakes!",
        "upvotes": 2210,
        "author": "Fastman99",
        "flair": "you love to see it",
        "subreddit": "JoeBiden",
        "date": 1599953561
    },
    {
        "id": "igz8aa",
        "title": "There are 69 days left until we elect Joe Biden president.",
        "content": "Nice.",
        "upvotes": 1826,
        "author": "cmallard2011",
        "flair": "🌶 Spicy 🌶",
        "subreddit": "JoeBiden",
        "date": 1598450025
    },
    {
        "id": "jjd0y6",
        "title": "In case your are wondering when we will know the election results, here is the breakdown:",
        "content": "Here is a breakdown of what we will know on election night:\n\nWe will know the results of all non-swing states on election night (swing states include FL, NC, AZ, MI, WI, PA, ME-2, NE-2, GA, TX, NV, NH, MN, and IA)\n\nFlorida: We will know the results unless the race is within 0.5%\n\nNorth Carolina: We will know the results unless the race is within 0.5%\n\nArizona: A 75% chance we will know on election night. If we do not know the winner, we will know on the 4th by evening time\n\nMichigan: We will most likely not know unless it is a Biden landslide. We will know by the evening of the 6th.\n\nWisconsin: We will NOT know on election night unless Biden landslide. We will know by the evening of the 10th\n\nPennsylvania: We will NOT know the winner on election night. Most likely will find out anywhere the 7th-17th\n\nMaine 2nd District/Nebraska 2nd District: 50% chance we know on election night, almost guaranteed we will know by the evening of the 7th\n\nGeorgia: If Trump carries the state by 2+ points, we will know the winner on election night. Otherwise, we will know by the evening of the 5th\n\nTexas: Unless Trump wins by 4+ points, we will not know until the evening of the 4th\n\nNevada and Minnesota: We will NOT know Nevada on election night and a 50% chance we know Minnesota. Will know both of those states by the 7th\n\nIowa: We will only know if Trump has won, if we do not know the result of Iowa, that is very good as that means Biden has a very good chance of winning it\n\nPlease upvote, this took me 45 minutes to research it and write it 🖊",
        "upvotes": 1315,
        "author": "CriticalMarionberry0",
        "flair": "🚆Ridin' with Biden 🚉",
        "subreddit": "JoeBiden",
        "date": 1603842775
    },
    {
        "id": "jllp2e",
        "title": "Convinced my Aunt in PA to vote Biden! She was a suburban woman who voted Trump in 2016.",
        "content": "Just thought I'd share the good news!  The sad part is she is afraid of her husband knowing so I swore I wouldn't spread the news within the family.\n\n\\+1 for Biden from a former Trump supporter in PA! :)",
        "upvotes": 1007,
        "author": "in_shits_creek",
        "flair": ":pennsylvania: Pennsylvania",
        "subreddit": "JoeBiden",
        "date": 1604163007
    },
    {
        "id": "ix29qx",
        "title": "Just because I dislike Trump more than Biden doesn’t mean I’m a Democrat",
        "content": "Some people on this sub won’t let you say anything bad about Trump unless you also talk shit about Biden in the same sentence.  I can dislike Trump more and still dislike Biden.\n\nNot to mention, Trump is the CURRENT president, so what he does affects me a lot more than what Biden may possibly, maybe do in the future.  I’m sure if Biden is elected I’ll have a lot to be angry about, but it’s a little hard to be angry about theoretical situations when in reality our president is harming our country on a daily basis.",
        "upvotes": 15681,
        "author": "TheBlueDinosaur",
        "flair": "Discussion",
        "subreddit": "Libertarian",
        "date": 1600701072
    },
    {
        "id": "irmsvn",
        "title": "This sub is devolving into orange man bad and that’s disappointing.",
        "content": "Now wait- you might say- orange man IS bad!\n\nI agree. I’m totally on board with that! I think both political parties right now have policies that are a serious threat to individual liberties. On top of that, I think Trump as a human in general is not a great guy. \n\nHowever, (to my knowledge) this subreddit is supposed to be different than the rest of reddit, which is a total a political echo chamber.\n\nIt’s frustrating to come to a place where there is supposed to be real political discussion, especially of libertarian ideals, and instead, be greeted by a top post on hot (at the time of writing) that has NOTHING to do with libertarian philosophy or even politics in general!\n\nWhen I come to r/libertarian I don’t care that Trump said he had the biggest tower in Manhattan after 9/11. Awful thing to say. But it doesn’t belong here! I can read that and a variety of other “Trump Bad” posts by going to r/all. What does Trump saying that have to do with libertarianism?\n\nI feel like leading up to the election this sub has gradually decreased in quality- and is slowly turning into the rest of Reddit, an obsession with Donald Trump.\n\nI don’t have a solution, just a bit of a rant. \n\nIf anyone does want to discuss libertarian ideals, I’ve been reading lots of Nozick lately, and am starting “Economics in One”. Lots of interesting things in those if anyone wants to comment!",
        "upvotes": 2583,
        "author": "Zebrinny",
        "flair": "Discussion",
        "subreddit": "Libertarian",
        "date": 1599951873
    },
    {
        "id": "j50qch",
        "title": "The 2020 election should be the educational film used to explain why we need a third (or fourth) party.",
        "content": "I mean, if people can't see how broken and ineffective these two parties have become from this election  I'm not sure how to open their eyes.   When they put out candidates like Trump and Biden and have Pelosi and McConnell holding everything hostage while they argue over how many trillions  will be sent to everyone (from their own money) I'm at a loss. Help me formulate a good response to the naysayers. THAT should be the national campaign for the libertarian party right now.",
        "upvotes": 2369,
        "author": "meldoy_the_rage",
        "flair": "Discussion",
        "subreddit": "Libertarian",
        "date": 1601825274
    },
    {
        "id": "iwtbwl",
        "title": "No, I am not voting 3rd part to keep a racist in office.",
        "content": "I was just lectured today from a close friend on how I’m wasting my vote and that I’m “part of the problem” in today’s political fuckfest. I don’t give a fuck whether you think trump is a racist. You’re not entitled to my vote. Why the fuck does it matter to your encamped political echo chamber circle jerk of where my vote goes. It’s not “splitting the vote”. It’s not “enabling the other side”. It’s not “throwing my vote away”.\n\nIt’s only “splitting the vote” because you uninformed and naïve fuckstick can’t imagine voting 3rd party let alone informing yourself on more than 2 options every election cycle. If your excuse is “the American people are not informed enough on 3rd parties therefore I will vote D/R”, then YOU are part of the problem.\n\n\n\nEDIT: Should have put quotations around “keep a racist in office”. This aught to cause some more controversy. Fucking bring it",
        "upvotes": 1707,
        "author": "TheAeroEngineer99",
        "flair": "Discussion",
        "subreddit": "Libertarian",
        "date": 1600661709
    },
    {
        "id": "iuqsul",
        "title": "I just got a call for a political poll that had Jo listed as a possible choice.",
        "content": "Just simply surprised me was all. Not only that, but Jo was actually the first candidate mentioned, followed by someone who is running as an Independent, then Biden and Trump. Not sure what it was about, it was only 3 or so questions, but still thought it was a good thing that there were more than two options. Feels like a step in the right direction.",
        "upvotes": 1248,
        "author": "YaMomSmellsNice",
        "flair": "Discussion",
        "subreddit": "Libertarian",
        "date": 1600371749
    },
    {
        "id": "iv7lkg",
        "title": "Hating both Trump and Biden does not by nature make you a Libertarian.",
        "content": "Voting for our nominated candidate is wonderful but that does not make you a Libertarian. This is not a refugee camp for disillusioned Republicans or Democrats. We are our own party with our own platform  and we've been here for many many years.",
        "upvotes": 350,
        "author": "bassshred",
        "flair": "Discussion",
        "subreddit": "Libertarian",
        "date": 1600440976
    },
    {
        "id": "jd5bqw",
        "title": "New Zealand record support for libertarian party",
        "content": "In the 2020 New Zealand election held on 17 October, the libertarian and classical liberal party, ACT (Association of Consumers and Taxpayers), achieved a record high 8% of the total vote.\n\nThis results in 8% of the seats in Parliament (House of Representatives) being held by ACT.\n\nPrior to the election, ACT held 0.5% of the vote and just one seat out of the 120 total seats.\n\nDuring the last parliamentary term, bills would be passed 119-1, with the single ACT member of parliament the only voice opposing laws severely restricting freedom.\n\nThe major conservative opposition party, National, collapsed in a year where there were 3 different leaders, including one who kept a Trump MAGA hat displayed prominently in his office.\n\nAs a member of ACT, I'm proud of what we achieved this election, and the new reinforcements will be key voices to hold prime minister Ardern's Labour government to account.\n\nThere is huge momentum for libertarianism here, and I sincerely wish libertarians in other countries hold on to hope, because there are many of us fighting to preserve freedoms and choice.",
        "upvotes": 333,
        "author": "I_lend_to_banks",
        "flair": "Discussion",
        "subreddit": "Libertarian",
        "date": 1602976494
    },
    {
        "id": "ihp5lv",
        "title": "If you support Trump, you aren’t a libertarian",
        "content": "If you support Trump, you aren’t libertarian (I’m serious).\n\nSo I’ve seen 'libertarians' on YouTube, reddit, and twitter say that they will be voting for Trump and that \"Trump is more libertarian than the libertarian party.\"\n\nNow I understand the criticisms of the LP and a lot of them are valid. But to say that Trump is libertarian is laughable. \n\nSo I’m going to go over Trumps term and point to policies which he pushed which are anti liberty and anti libertarian. \n\n1. The National Debt: \n\nDonald Trump is the worst president in history when it comes to the national debt. In 4 years, he added more to the national debt then Obama did in 8 and Bush did 8. Trump increased the deficit by hundreds of billions of dollars.\n\n2. The Second Amendment: \n\nTrump is anti second amendment, and so is the Republican Party. Trump passed the first gun control in decades which banned bump stocks. Trump hates the second amendment.\n\n3. The Patriot Act/NSA Spying: \n\nTrump claims he hates unwarranted surveillance yet he expanded the patriot act and extended it. Trump expanded it and can now spy on us since 2018. \n\n4. Trumps drone strikes:\n\nObama is known as the 'bomber in chief' which is true. But Trump has actually surpassed Obama in drone strikes and actually is the biggest drone striker in history. \n\n5. Trump didn’t end the wars\n\nTrump didn’t end the wars and has actually expanded them in different countries and added troops there. \n\n6. Hates Free Market capitalism \n\nTrump doesn’t support capitalism and instead supports corporatism. He supported massive bailouts of corporations which increased the debt and kept failing companies afloat. He’s a corporatist who supported the cares act, the biggest transfer of wealth in history. \n\nTrump is a fraud and libertarians should hate him as much as Biden.",
        "upvotes": 300,
        "author": "Dumbass1171",
        "flair": "Discussion",
        "subreddit": "Libertarian",
        "date": 1598548685
    }
]